espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_struct.h
typedef union {
    struct {
        uint32_t force_hp_pad_no_iso_all: 1;
        uint32_t force_hp_pad_iso_all   : 1;
        uint32_t reserved0              : 30;
    };
    uint32_t val;
} pmu_power_hp_pad_reg_t;

typedef union {
    struct {
        uint32_t wait_xtal_stable: 16;
        uint32_t wait_pll_stable : 16;
    };
    uint32_t val;
} pmu_power_clk_wait_cntl_reg_t;

typedef struct pmu_power_hw_regmap_t {
    pmu_power_wait_timer0_reg_t    wait_timer0;
    pmu_power_wait_timer1_reg_t    wait_timer1;
    pmu_power_domain_cntl_reg_t    hp_pd[3];
    pmu_power_domain_mask_reg_t    hp_pd_mask[3];
    pmu_power_dcdc_switch_reg_t    dcdc_switch;
    pmu_power_domain_cntl_reg_t    lp_peri;
    pmu_power_domain_mask_reg_t    lp_peri_mask;
    pmu_power_hp_pad_reg_t         hp_pad;
    pmu_power_clk_wait_cntl_reg_t  clk_wait;
} pmu_power_hw_regmap_t;

typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t sleep_req: 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl0_reg_t;

typedef union {
    struct {
        uint32_t sleep_reject_ena: 31;
        uint32_t slp_reject_en   : 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl1_reg_t;

typedef union {
    struct {
        uint32_t wakeup_ena: 31;
        uint32_t reserved0 : 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl2_reg_t;

typedef union {
    struct {
        uint32_t lp_min_slp_val: 8;
        uint32_t hp_min_slp_val: 8;
        uint32_t sleep_prt_sel : 2;
        uint32_t reserved0     : 14;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl3_reg_t;

typedef union {
    struct {
        uint32_t reserved0           : 31;
        uint32_t slp_reject_cause_clr: 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl4_reg_t;

typedef union {
    struct {
        uint32_t modem_wait_target          : 20;
        uint32_t reserved0                  : 2;
        uint32_t lp_ana_wait_target_expand  : 2;
        uint32_t lp_ana_wait_target         : 8;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl5_reg_t;

typedef union {
    struct {
        uint32_t soc_wakeup_wait    : 20;
        uint32_t reserved0          : 10;
        uint32_t soc_wakeup_wait_cfg: 2;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl6_reg_t;

typedef union {
    struct {
        uint32_t reserved0      : 16;
        uint32_t ana_wait_target: 16;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl7_reg_t;

typedef union {
    struct {
        uint32_t reserved0          : 31;
        uint32_t lp_lite_wakeup_ena : 1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl8_reg_t;

typedef struct pmu_wakeup_hw_regmap_t {
    pmu_slp_wakeup_cntl0_reg_t     cntl0;
    pmu_slp_wakeup_cntl1_reg_t     cntl1;
    pmu_slp_wakeup_cntl2_reg_t     cntl2;
    pmu_slp_wakeup_cntl3_reg_t     cntl3;
    pmu_slp_wakeup_cntl4_reg_t     cntl4;
    pmu_slp_wakeup_cntl5_reg_t     cntl5;
    pmu_slp_wakeup_cntl6_reg_t     cntl6;
    pmu_slp_wakeup_cntl7_reg_t     cntl7;
    pmu_slp_wakeup_cntl8_reg_t     cntl8;
    uint32_t                       status0;
    uint32_t                       status1;
    uint32_t                       status2;
} pmu_wakeup_hw_regmap_t;

typedef union {
    struct {
        uint32_t i2c_por_wait_target: 8;
        uint32_t reserved0          : 24;
    };
    uint32_t val;
} pmu_hp_clk_poweron_reg_t;

typedef union {
    struct {
        uint32_t modify_icg_cntl_wait: 8;
        uint32_t switch_icg_cntl_wait: 8;
        uint32_t reserved0           : 16;
    };
    uint32_t val;
} pmu_hp_clk_cntl_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t por_done : 1;
    };
    uint32_t val;
} pmu_por_status_reg_t;

typedef union {
    struct {
        uint32_t reserved0     : 24;
        uint32_t mspi_phy_xpd  : 1;
        uint32_t sdio_pll_xpd  : 1;
        uint32_t perif_i2c_rstb: 1;
        uint32_t xpd_perif_i2c : 1;
        uint32_t xpd_txrf_i2c  : 1;
        uint32_t xpd_rfrx_pbus : 1;
        uint32_t xpd_ckgen_i2c : 1;
        uint32_t reserved1     : 1;
    };
    uint32_t val;
} pmu_rf_pwc_reg_t;

typedef union {
    struct {
        uint32_t reserved0          : 31;
        uint32_t backup_sysclk_nodiv: 1;
    };
    uint32_t val;
} pmu_backup_cfg_reg_t;

typedef union {
    struct {
        uint32_t reserved0   : 14;
        uint32_t pmu_0p1a_cnt_target0_reach_0 : 1;
        uint32_t pmu_0p1a_cnt_target1_reach_0 : 1;
        uint32_t pmu_0p1a_cnt_target0_reach_1 : 1;
        uint32_t pmu_0p1a_cnt_target1_reach_1 : 1;
        uint32_t pmu_0p2a_cnt_target0_reach_0 : 1;
        uint32_t pmu_0p2a_cnt_target1_reach_0 : 1;
        uint32_t pmu_0p2a_cnt_target0_reach_1 : 1;
        uint32_t pmu_0p2a_cnt_target1_reach_1 : 1;
        uint32_t pmu_0p3a_cnt_target0_reach_0 : 1;
        uint32_t pmu_0p3a_cnt_target1_reach_0 : 1;
        uint32_t pmu_0p3a_cnt_target0_reach_1 : 1;
        uint32_t pmu_0p3a_cnt_target1_reach_1 : 1;
        uint32_t reserved1   : 1;
        uint32_t lp_exception: 1;
        uint32_t sdio_idle: 1;
        uint32_t sw       : 1;
        uint32_t reject   : 1;
        uint32_t wakeup   : 1;
    };
    uint32_t val;
} pmu_hp_intr_reg_t;

typedef struct pmu_hp_ext_hw_regmap_t {
    pmu_hp_clk_poweron_reg_t   clk_poweron;
    pmu_hp_clk_cntl_reg_t      clk_cntl;
    pmu_por_status_reg_t       por_status;
    pmu_rf_pwc_reg_t           rf_pwc;
    pmu_backup_cfg_reg_t       backup_cfg;
    pmu_hp_intr_reg_t          int_raw;
    pmu_hp_intr_reg_t          int_st;
    pmu_hp_intr_reg_t          int_ena;
    pmu_hp_intr_reg_t          int_clr;
} pmu_hp_ext_hw_regmap_t;

typedef union {
    struct {
        uint32_t reserved0                    : 13;
        uint32_t sleep_reject                 : 1;
        uint32_t pmu_0p1a_cnt_target0_reach_0 : 1;
        uint32_t pmu_0p1a_cnt_target1_reach_0 : 1;
        uint32_t pmu_0p1a_cnt_target0_reach_1 : 1;
        uint32_t pmu_0p1a_cnt_target1_reach_1 : 1;
        uint32_t pmu_0p2a_cnt_target0_reach_0 : 1;
        uint32_t pmu_0p2a_cnt_target1_reach_0 : 1;
        uint32_t pmu_0p2a_cnt_target0_reach_1 : 1;
        uint32_t pmu_0p2a_cnt_target1_reach_1 : 1;
        uint32_t pmu_0p3a_cnt_target0_reach_0 : 1;
        uint32_t pmu_0p3a_cnt_target1_reach_0 : 1;
        uint32_t pmu_0p3a_cnt_target0_reach_1 : 1;
        uint32_t pmu_0p3a_cnt_target1_reach_1 : 1;
        uint32_t lp_wakeup                    : 1;
        uint32_t sleep_switch_active_end      : 1;
        uint32_t active_switch_sleep_end      : 1;
        uint32_t sleep_switch_active_start    : 1;
        uint32_t active_switch_sleep_start    : 1;
        uint32_t hp_sw_trigger                : 1;
    };
    uint32_t val;
} pmu_lp_intr_reg_t;

