espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_struct.h
typedef union {
    struct {
        uint32_t waiti_rdy         : 1;
        uint32_t stall_rdy         : 1;
        uint32_t reserved0         : 16;
        uint32_t force_stall       : 1;
        uint32_t slp_waiti_flag_en : 1;
        uint32_t slp_stall_flag_en : 1;
        uint32_t slp_stall_wait    : 8;
        uint32_t slp_stall_en      : 1;
        uint32_t slp_reset_en      : 1;
        uint32_t slp_bypass_intr_en: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr0_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t sleep_req: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr1_reg_t;

typedef union {
    struct {
        uint32_t wakeup_en: 31;
        uint32_t reserved0: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr2_reg_t;

typedef union {
    struct {
        uint32_t wakeup_cause: 31;
        uint32_t reserved0: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr3_reg_t;

typedef union {
    struct {
        uint32_t sleep_reject: 31;
        uint32_t reserved0: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr4_reg_t;

typedef union {
    struct {
        uint32_t sleep_reject_cause: 31;
        uint32_t reserved0: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr5_reg_t;

typedef struct pmu_lp_ext_hw_regmap_t {
    pmu_lp_intr_reg_t          int_raw;
    pmu_lp_intr_reg_t          int_st;
    pmu_lp_intr_reg_t          int_ena;
    pmu_lp_intr_reg_t          int_clr;
    pmu_lp_cpu_pwr0_reg_t      pwr0;
    pmu_lp_cpu_pwr1_reg_t      pwr1;
    pmu_lp_cpu_pwr2_reg_t      pwr2;
    pmu_lp_cpu_pwr3_reg_t      pwr3;
    pmu_lp_cpu_pwr4_reg_t      pwr4;
    pmu_lp_cpu_pwr5_reg_t      pwr5;
} pmu_lp_ext_hw_regmap_t;

typedef union {
    struct {
        uint32_t reserved_0:6;
        uint32_t cnt_clr:1;
        uint32_t force_tieh_sel:1;
        uint32_t xpd:1;
        uint32_t tieh_sel:3;
        uint32_t tieh_pos_en:1;
        uint32_t tieh_neg_en:1;
        uint32_t tieh:1;
        uint32_t target1:8;
        uint32_t target0:8;
        uint32_t ldo_cnt_prescaler_sel:1;
    };
    uint32_t val;
} pmu_ext_ldo_reg_t;

typedef union {
    struct {
        uint32_t reserved_0:23;
        uint32_t mul:3;
        uint32_t en_vdet:1;
        uint32_t en_cur_lim:1;
        uint32_t dref:4;
    };
    uint32_t val;
} pmu_ext_ldo_ana_reg_t;


typedef struct pmu_ext_ldo_info_t {
    pmu_ext_ldo_reg_t pmu_ext_ldo;
    pmu_ext_ldo_ana_reg_t pmu_ext_ldo_ana;
} pmu_ext_ldo_info_t;


typedef union {
    struct {
        uint32_t on_req        : 1;
        uint32_t off_req       : 1;
        uint32_t lightslp_req  : 1;
        uint32_t deepslp_req   : 1;
        uint32_t reserved0     : 3;
        uint32_t done_force    : 1;
        uint32_t on_force_pu   : 1;
        uint32_t on_force_pd   : 1;
        uint32_t fb_res_force_pu   : 1;
        uint32_t fb_res_force_pd   : 1;
        uint32_t ls_force_pu   : 1;
        uint32_t ls_force_pd   : 1;
        uint32_t ds_force_pu   : 1;
        uint32_t ds_force_pd   : 1;
        uint32_t dcm_cur_st    : 8;
        uint32_t reserved1     : 5;
        uint32_t en_amux_test  : 1;
        uint32_t reserved2     : 2;
    };
    uint32_t val;
} pmu_dcm_ctrl_reg_t;

typedef union {
    struct {
        uint32_t pre_delay      : 8;
        uint32_t res_off_delay  : 8;
        uint32_t stable_delay   : 10;
        uint32_t reserved0      : 6;
    };
    uint32_t val;
} pmu_dcm_wait_delay_t;

typedef union {
    struct {
        uint32_t module     : 2;
        uint32_t reserved1  : 29;
        uint32_t sw_update  : 1;
    };
    uint32_t val;
} pmu_vddbat_cfg_t;

typedef union {
    struct {
        uint32_t reserved0      : 5;
        uint32_t wait_cycles    : 9;
        uint32_t sleep_cycles   : 16;
        uint32_t force_done     : 1;
        uint32_t sleep_timer_en : 1;
    };
    uint32_t val;
} pmu_touch_sensor_pwr_cntl_t;

typedef struct pmu_dev_t {
    volatile pmu_hp_hw_regmap_t     hp_sys[3];
    volatile pmu_lp_hw_regmap_t     lp_sys[2];
    volatile pmu_imm_hw_regmap_t    imm;
    volatile pmu_power_hw_regmap_t  power;
    volatile pmu_wakeup_hw_regmap_t wakeup;
    volatile pmu_hp_ext_hw_regmap_t hp_ext;
    volatile pmu_lp_ext_hw_regmap_t lp_ext;

    union {
        struct {
            volatile uint32_t reserved0    : 30;
            volatile uint32_t lp_trigger_hp: 1;
            volatile uint32_t hp_trigger_lp: 1;
        };
        volatile uint32_t val;
    } hp_lp_cpu_comm;

    union {
        struct {
            volatile uint32_t reserved0           : 31;
            volatile uint32_t dig_regulator_en_cal: 1;
        };
        volatile uint32_t val;
    } hp_regulator_cfg;

    union {
        struct {
            volatile uint32_t en_cali_pmu_cntl : 1;
            volatile uint32_t reserved0 : 10;
            volatile uint32_t last_st   : 7;
            volatile uint32_t target_st : 7;
            volatile uint32_t current_st: 7;
        };
        volatile uint32_t val;
    } main_state;

    union {
        struct {
            volatile uint32_t reserved0: 13;
            volatile uint32_t backup_st: 5;
            volatile uint32_t lp_pwr_st: 5;
            volatile uint32_t hp_pwr_st: 9;
        };
        volatile int32_t val;
    } pwr_state;

    union {
        struct {
            volatile uint32_t stable_xpd_bbpll : 3;
            volatile uint32_t stable_xpd_xtal  : 1;
            volatile uint32_t ana_xpd_pll_i2c  : 3;
            volatile uint32_t reserved0        : 3;
            volatile uint32_t sysclk_slp_sel   : 1;
            volatile uint32_t sysclk_sel       : 2;
            volatile uint32_t sysclk_nodiv     : 1;
            volatile uint32_t icg_sysclk_en    : 1;
            volatile uint32_t icg_modem_switch : 1;
            volatile uint32_t icg_modem_code   : 2;
            volatile uint32_t icg_slp_sel      : 1;
            volatile uint32_t icg_global_xtal  : 1;
            volatile uint32_t icg_global_pll   : 4;
            volatile uint32_t ana_i2c_iso_en   : 1;
            volatile uint32_t ana_i2c_retention: 1;
            volatile uint32_t reserved1        : 1;
            volatile uint32_t ana_xpd_pll      : 4;
            volatile uint32_t ana_xpd_xtal     : 1;
        };
        volatile uint32_t val;
    } clk_state0;

    volatile uint32_t clk_state1;
    volatile uint32_t clk_state2;

    volatile pmu_ext_ldo_info_t ext_ldo[6];

