espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_struct.h
    volatile uint32_t ext_wakeup_lv;
    volatile uint32_t ext_wakeup_sel;
    volatile uint32_t ext_wakeup_st;
    union {
        struct {
            volatile uint32_t reserved0      : 30;
            volatile uint32_t status_clr     : 1;
            volatile uint32_t filter         : 1;
        };
        volatile uint32_t val;
    } ext_wakeup_cntl;

    union {
        struct {
            volatile uint32_t act_dnum   : 10;
            volatile uint32_t reserved0  : 22;
        };
        volatile uint32_t val;
    } sdio_wakeup_cntl;

    union {
        struct {
            volatile uint32_t reserved0  : 16;
            volatile uint32_t cnt_target : 16;
        };
        volatile uint32_t val;
    } xtal_slp;

    union {
        struct {
            volatile uint32_t reserved0  : 16;
            volatile uint32_t hpcore1_stall_code : 8;
            volatile uint32_t hpcore0_stall_code : 8;
        };
        volatile uint32_t val;
    } cpu_sw_stall;

    volatile pmu_dcm_ctrl_reg_t dcm_ctrl;
    volatile pmu_dcm_wait_delay_t dcm_delay;
    volatile pmu_vddbat_cfg_t vbat_cfg;
    volatile pmu_touch_sensor_pwr_cntl_t touch_pwr_cntl;

    union {
        struct {
            volatile uint32_t eco_result:1;
            volatile uint32_t reserved0  : 30;
            volatile uint32_t eco_en: 1;

        };
        volatile uint32_t val;
    } pmu_rdn_eco;

    union {
        struct {
            volatile uint32_t force_hp_cpu_reset    :   1;
            volatile uint32_t force_hp_cpu_iso      :   1;
            volatile uint32_t force_hp_cpu_pu       :   1;
            volatile uint32_t force_hp_cpu_no_reset :   1;
            volatile uint32_t force_hp_cpu_no_iso   :   1;
            volatile uint32_t force_hp_cpu_pd       :   1;
            volatile uint32_t reserved0             :   26;
        };
        volatile uint32_t val;
    } power_pd_hp_cpu_cntl;

    union {
        struct {
            volatile uint32_t xpd_hp_cpu_mask   :   5;
            volatile uint32_t pd_hp_cpu_mask    :   27;
        };
        volatile uint32_t val;
    } power_pd_hp_cpu_mask;

    uint32_t reserved[119];

    union {
        struct {
            volatile uint32_t pmu_date: 31;
            volatile uint32_t clk_en  : 1;
        };
        volatile uint32_t val;
    } date;
} pmu_dev_t;

extern pmu_dev_t PMU;

#ifndef __cplusplus
_Static_assert(sizeof(pmu_dev_t) == 0x400, "Invalid size of pmu_dev_t structure");

_Static_assert(offsetof(pmu_dev_t, reserved) == (PMU_POWER_PD_HP_CPU_MASK_REG - DR_REG_PMU_BASE) + 4, "Invalid size of pmu_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
